app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    # Renders /views/admin/index.html.erb
    @users = User.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "edit"]]
---
  def show
    @users = User.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @users = User.find(params[:id])