app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    if @movie.save
---
INSERT INTO "movies" ("created_at", "description", "director", "poster_image_url", "release_date", "runtime_in_minutes", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @movie = Movie.find(params[:id])

    if movie.update_attributes(movie_params)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "director" = ?, "poster_image_url" = ?, "updated_at" = ? WHERE "movies"."id" = 2  [["director", "Chris"], ["poster_image_url", "MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw__._V1_UX182_CR0_0_182_268_AL_.jpg"], ["updated_at", Tue, 26 Apr 2016 16:37:40 UTC +00:00]]