app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("created_at", "movie_id", "rating_out_of_ten", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Tue, 26 Apr 2016 12:57:18 UTC +00:00], ["movie_id", 1], ["rating_out_of_ten", 9], ["text", "Awesome movie!"], ["updated_at", Tue, 26 Apr 2016 12:57:18 UTC +00:00], ["user_id", 2]]
---
      def create
        @review = @movie.reviews.build(review_params)
        @review.user_id = current_user.id

        if @review.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT 1  [["id", 1]]
---
      def load_movie
        @movie = Movie.find(params[:movie_id])